package homework_13;

public class DebugTask3 {
    //Задача 3:
    //Код должен напечатать числа от 1 до 5, но программа зависает.

    //print: 1, 2, 3, 4, 5
    public static void main(String[] args) {
        //1<=5 -> true
        for (int i = 1; i <= 5; i++) {
            System.out.println("Number: " + i);
        }
    }
}